{
	"header": {
		"home": "Моє портфоліо",
		"nav": {
			"about": "Про мене",
			"skills": "Скіли",
			"projects": "Роботи",
			"contact": "Контакт"
		}
	},
	"main": {
		"about": {
			"title": "Про мене",
			"text": {
				"titleText": "Привіт! Я — Олександр, той, хто змушує пікселі працювати",
				"textOne1": "Мені 24 роки. Мій шлях в ІТ розпочався у 18, коли я створив власну гру для телефону. ",
				"textOne2": "Протягом наступних двох років я зрозумів, що розробка ігор — це не зовсім те, чим я хочу займатися. ",
				"textOne3": "У пошуках нового напрямку я відкрив для себе ",
				"textOneAccent": "Front-End",
				"textTwo1": "Я почав вивчати веб-розробку самостійно, через онлайн-матеріали. ",
				"textTwo2": "Так, це не найнадійніший шлях, але він дав мені базові знання та практику. ",
				"textTwo3": "Я виконував невеликі завдання, вносив правки у проєкти та з кожним кроком дізнавався щось нове. ",
				"textTwo4": "Наразі я навчаюся у ",
				"textTwoAccent": "StepIT"
			}
		},
		"skills": {
			"title": "Скіли",
			"cart": [
				{
					"title": "HTML",
					"text": "Розмічаю семантично. Впевнено працюю з формами, табличками, медіа.",
					"textAccent": "Впевнений рівень"
				},
				{
					"title": "CSS",
					"text": "Володію Flexbox та Grid, створюю адаптивні й кросбраузерні інтерфейси.",
					"textAccent": "Впевнений рівень"
				},
				{
					"title": "SCSS",
					"text": "Використовую змінні, вкладеність, міксіни для структури і повторного використання стилів.",
					"textAccent": "Середній рівень"
				},
				{
					"title": "JS",
					"text": "Пишу чистий код, працюю з DOM, подіями та асинхронністю (fetch, async/await).",
					"textAccent": "Впевнений рівень"
				},
				{
					"title": "Figma",
					"text": "Використовую для перегляду макетів, роботи з UI/UX та адаптації дизайну під верстку.",
					"textAccent": "Впевнений рівень"
				},
				{
					"title": "Problem Solving",
					"text": "Швидко знаходжу рішення навіть у складних ситуаціях.Використовую логіку, креативність і досвід, щоб долати технічні й нетехнічні виклики.",
					"textAccent": "Впевнений рівень"
				}
			]
		},
		"projects": {
			"title": "Роботи",
			"text": "Портфоліо поповнюється – наразі готую проєкти до публікації. Дякую за інтерес!"
		},
		"contact": {
			"title": "Контакти"
		}
	},
	"footer": [
		"День — дедлайни, вечір — фреймворки, ніч — баги, а життя — Front-End Developer.",
		"© 2025 Єкімов Олександр. Усі права захищені."
	]
}